In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  1.103372  0.011147  0.404674       NaN
1      1  2.073377  0.516029       NaN -0.167050
2      2       NaN -2.166764 -0.770027  0.118722
3      3  0.352855       NaN -0.250275 -1.919385
4      4  0.565376  0.711193 -2.093848 -1.080959

In [3]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  1.103372  0.011147  0.404674       NaN
1  1  2.073377  0.516029       NaN -0.167050
2  2       NaN -2.166764 -0.770027  0.118722
3  3  0.352855       NaN -0.250275 -1.919385
4  4  0.565376  0.711193 -2.093848 -1.080959

In [4]:
df_backup = df.copy(deep=True)

In [5]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [6]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

     Z         A         B         C         D
4    4  0.565376  0.711193 -2.093848 -1.080959
5    5  0.263315 -0.481797  0.027742  0.990740
6    6 -1.777779  0.808160  1.626061  1.126107
12  12 -1.835945  0.720236 -0.487942 -0.622234
21  21  0.128714 -0.032996  0.410140  0.507633

In [7]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.266667
B    0.200000
C    0.233333
D    0.233333
dtype: float64

In [ ]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

: